zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_flash_srom.h
/************************************/
/*** Flash Program Row Structures ***/
/************************************/

typedef enum
{
    CY_SROM_PROGRAMROW_DATA_SIZE_8BIT    = (0x00UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_16BIT   = (0x01UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_32BIT   = (0x02UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_64BIT   = (0x03UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_128BIT  = (0x04UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_256BIT  = (0x05UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_512BIT  = (0x06UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_1024BIT = (0x07UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_2048BIT = (0x08UL),
    CY_SROM_PROGRAMROW_DATA_SIZE_4096BIT = (0x09UL)
} cy_en_programrow_datasize_t;

typedef enum
{
    CY_SROM_PROGRAMROW_NON_BLOCKING = (0x00UL), // Non-blocking
    CY_SROM_PROGRAMROW_BLOCKING     = (0x01UL)  // API blocks CM0+
} cy_en_programrow_blocking_t;

typedef enum
{
    CY_SROM_PROGRAMROW_BLANK_CHECK      =  (0x00UL), // Perform blank check
    CY_SROM_PROGRAMROW_SKIP_BLANK_CHECK =  (0x01UL)  // Skips the blank check step
} cy_en_programrow_skipblankcheck_t;

typedef enum
{
    CY_SROM_PROGRAMROW_DATA_LOCATION_SRAM = (0x01UL) // SRAM
} cy_en_programrow_location_t;

typedef enum
{
    CY_SROM_PROGRAMROW_NOT_SET_INTR_MASK = (0x00UL), // Set FM interrupt mask
    CY_SROM_PROGRAMROW_SET_INTR_MASK     = (0x01UL)  // Don't set FM interrupt mask
} cy_en_programrow_intrmask_t;

/* Request Message */
typedef struct
{
    uint32_t rev0           : 8; // reserved
    uint32_t blocking       : 8; // Blocking. see \ref cy_en_programrow_blocking_t
    uint32_t skipBlankCheck : 8; // Skip blank check. see \ref cy_en_programrow_skipblankcheck_t
    uint32_t opcode         : 8; // Opcode = 0x06
} cy_stc_program_row_arg0_t;

typedef struct
{
    uint32_t dataSize      : 8; // Data size. see \ref cy_en_programrow_datasize_t
    uint32_t dataLoc       : 8; // Data location. see \ref cy_en_programrow_location_t
    uint32_t rev0          : 8; // reserved
    uint32_t interruptMask : 8; // Interrupt mask (Applicable only for eCT non-blocking). see \ref cy_en_programrow_intrmask_t
} cy_stc_program_row_arg1_t;

typedef struct
{
    uint32_t dstAddr : 32; // Flash address to be programmed
} cy_stc_program_row_arg2_t;

typedef struct
{
    uint32_t srcAddr : 32; // 32-bit aligned address of SRAM where data to be programmed will be stored
} cy_stc_program_row_arg3_t;

typedef struct
{
    cy_stc_program_row_arg0_t arg0;
    cy_stc_program_row_arg1_t arg1;
    cy_stc_program_row_arg2_t arg2;
    cy_stc_program_row_arg3_t arg3;
} cy_stc_program_row_args_t;

/* Response Message */
typedef struct
{
    uint32_t Indication : 28; // indication
    uint32_t statusCode : 4;  // status code
} cy_stc_program_row_resp0_t;

typedef struct
{
    cy_stc_program_row_resp0_t resp0;
    uint32_t                   resv[3];
} cy_stc_program_row_resps_t;

/*************************************/
/*** Flash Erase Sector Structures ***/
/*************************************/
typedef enum
{
    CY_SROM_ERASE_NON_BLOCKING      = (0x00UL), // Non-blocking
    CY_SROM_ERASE_BLOCKING          = (0x01UL)  // API blocks CM0+
} cy_en_erase_blocking_t;

typedef enum
{
    CY_SROM_ERASE_NOT_SET_INTR_MASK = (0x00UL), // Set FM interrupt mask
    CY_SROM_ERASE_SET_INTR_MASK     = (0x01UL)  // Don't set FM interrupt mask
} cy_en_erase_intrmask_t;

/* Request Message */
typedef struct
{
    uint32_t rev0          : 8;
    uint32_t blocking      : 8; // see \ref cy_en_erase_blocking_t
    uint32_t interruptMask : 8; // see \ref cy_en_erase_intrmask_t
    uint32_t opcode        : 8; // Opcode = 0x14
} cy_stc_erase_sector_arg0_t;

typedef struct
{
    uint32_t address : 32;
} cy_stc_erase_sector_arg1_t;

typedef struct
{
    cy_stc_erase_sector_arg0_t arg0;
    cy_stc_erase_sector_arg1_t arg1;
    uint32_t resv[2];
} cy_stc_erase_sector_args_t;

/* Response Message */
typedef struct
{
    uint32_t indication : 28; // indication
    uint32_t statusCode : 4;  // status code
} cy_stc_erase_sector_resp0_t;

typedef struct
{
    cy_stc_erase_sector_resp0_t resp0;
    uint32_t                    resv[3];
} cy_stc_erase_sector_resps_t;

/**********************************/
/*** Flash Erase All Structures ***/
/**********************************/
/* Request Message */
typedef struct
{
    uint32_t rev0   : 24;
    uint32_t opcode : 8;
} cy_stc_erase_all_arg0_t;

typedef struct
{
    cy_stc_erase_all_arg0_t arg0;
    uint32_t                resv[3];
} cy_stc_erase_all_args_t;

/* Response Message */
typedef struct
{
    uint32_t indication : 28; // indication
    uint32_t statusCode : 4;  // status code
} cy_stc_erase_all_resp0_t;

typedef struct
{
    cy_stc_erase_sector_resp0_t resp0;
    uint32_t                    resv[3];
} cy_stc_erase_all_resps_t;

/****************************************/
/*** Flash Check FM Status Structures ***/
/****************************************/
/* Request Message */
typedef struct
{
    uint32_t rev0   : 24;
    uint32_t opcode : 8; // Opcode = 0x07
} cy_stc_check_fm_status_arg0_t;

typedef struct
{
    cy_stc_check_fm_status_arg0_t arg0;
    uint32_t                      resv[3];
} cy_stc_check_fm_status_args_t;

/* Response Message */
typedef struct
{
    uint16_t pgm_code         : 1; // Indicates if active PGM operation to the Code flash is taking place
    uint16_t pgm_work         : 1; // Indicates if active PGM operation to the Work flash is taking place
    uint16_t erase_code       : 1; // Indicates if active Erase operation to the Code flash is taking place
    uint16_t erase_work       : 1; // Indicates if active Erase operation to the Work flash is taking place
    uint16_t ers_suspend      : 1; // Indicates if Erase operation (Code/Work) is currently being suspended
    uint16_t blank_check_work : 1; // Indicates if Blank Check mode is currently running on the work flash
    uint16_t blank_check_pass : 1; // Indicates  the Blank check command result is Blank
    uint16_t hang             : 1; // After embedded operation (pgm/erase) this flag will tell if it was successful or failed
    uint16_t busy             : 1; // Whenever the device is in embedded mode the RDY goes
    uint16_t                  : 7; // reserved
} cy_stc_fm_status_t;

typedef union 
{
    uint16_t           u16;
    cy_stc_fm_status_t bf; // see \n cy_stc_fm_status_t
} cy_un_fm_status_t ;

typedef struct
{
    uint32_t status     : 9; // FM status
    uint32_t            :19; // reserved
    uint32_t statusCode : 4;  // status code
} cy_stc_check_fm_status_resp0_t;

typedef struct
{
    cy_stc_check_fm_status_resp0_t resp0;
    uint32_t                       resv[3];
} cy_stc_check_fm_status_resps_t;


/***********************************************/
/*** Flash Configure FM Interrupt Structures ***/
/***********************************************/
typedef enum
{
    CY_SROM_FM_INTR_OPT_CLEAR_INTR_MASK = (0x00UL),
    CY_SROM_FM_INTR_OPT_SET_INTR_MASK   = (0x01UL),
    CY_SROM_FM_INTR_OPT_CLEAR_INTR      = (0x02UL)
} cy_en_conf_fm_intr_option_t;

